weifengdq/embedded/tc364/0_Empty_Project/Libraries/Infra/Sfr/TC36x/IfxEdsadc_bf.h
/** \brief Offset for Ifx_EDSADC_CH_FCFGM_Bits.FIR0EN */
#define IFX_EDSADC_CH_FCFGM_FIR0EN_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_FCFGM_Bits.FIR1EN */
#define IFX_EDSADC_CH_FCFGM_FIR1EN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGM_Bits.FIR1EN */
#define IFX_EDSADC_CH_FCFGM_FIR1EN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_FCFGM_Bits.FIR1EN */
#define IFX_EDSADC_CH_FCFGM_FIR1EN_OFF (1u)

/** \brief Length for Ifx_EDSADC_CH_FCFGM_Bits.OVCEN */
#define IFX_EDSADC_CH_FCFGM_OVCEN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGM_Bits.OVCEN */
#define IFX_EDSADC_CH_FCFGM_OVCEN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_FCFGM_Bits.OVCEN */
#define IFX_EDSADC_CH_FCFGM_OVCEN_OFF (2u)

/** \brief Length for Ifx_EDSADC_CH_FCFGM_Bits.FIR1DEC */
#define IFX_EDSADC_CH_FCFGM_FIR1DEC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGM_Bits.FIR1DEC */
#define IFX_EDSADC_CH_FCFGM_FIR1DEC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_FCFGM_Bits.FIR1DEC */
#define IFX_EDSADC_CH_FCFGM_FIR1DEC_OFF (3u)

/** \brief Length for Ifx_EDSADC_CH_FCFGM_Bits.CICMOD */
#define IFX_EDSADC_CH_FCFGM_CICMOD_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGM_Bits.CICMOD */
#define IFX_EDSADC_CH_FCFGM_CICMOD_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_FCFGM_Bits.CICMOD */
#define IFX_EDSADC_CH_FCFGM_CICMOD_OFF (4u)

/** \brief Length for Ifx_EDSADC_CH_FCFGM_Bits.PFEN */
#define IFX_EDSADC_CH_FCFGM_PFEN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGM_Bits.PFEN */
#define IFX_EDSADC_CH_FCFGM_PFEN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_FCFGM_Bits.PFEN */
#define IFX_EDSADC_CH_FCFGM_PFEN_OFF (5u)

/** \brief Length for Ifx_EDSADC_CH_FCFGM_Bits.OCEN */
#define IFX_EDSADC_CH_FCFGM_OCEN_LEN (3u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGM_Bits.OCEN */
#define IFX_EDSADC_CH_FCFGM_OCEN_MSK (0x7u)

/** \brief Offset for Ifx_EDSADC_CH_FCFGM_Bits.OCEN */
#define IFX_EDSADC_CH_FCFGM_OCEN_OFF (8u)

/** \brief Length for Ifx_EDSADC_CH_FCFGM_Bits.OFFPROT */
#define IFX_EDSADC_CH_FCFGM_OFFPROT_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGM_Bits.OFFPROT */
#define IFX_EDSADC_CH_FCFGM_OFFPROT_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_FCFGM_Bits.OFFPROT */
#define IFX_EDSADC_CH_FCFGM_OFFPROT_OFF (11u)

/** \brief Length for Ifx_EDSADC_CH_FCFGM_Bits.FMWC */
#define IFX_EDSADC_CH_FCFGM_FMWC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGM_Bits.FMWC */
#define IFX_EDSADC_CH_FCFGM_FMWC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_FCFGM_Bits.FMWC */
#define IFX_EDSADC_CH_FCFGM_FMWC_OFF (15u)

/** \brief Length for Ifx_EDSADC_CH_FCFGM_Bits.SRGM */
#define IFX_EDSADC_CH_FCFGM_SRGM_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGM_Bits.SRGM */
#define IFX_EDSADC_CH_FCFGM_SRGM_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_FCFGM_Bits.SRGM */
#define IFX_EDSADC_CH_FCFGM_SRGM_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_FCFGM_Bits.SRGA */
#define IFX_EDSADC_CH_FCFGM_SRGA_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGM_Bits.SRGA */
#define IFX_EDSADC_CH_FCFGM_SRGA_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_FCFGM_Bits.SRGA */
#define IFX_EDSADC_CH_FCFGM_SRGA_OFF (20u)

/** \brief Length for Ifx_EDSADC_CH_FCFGM_Bits.ESEL */
#define IFX_EDSADC_CH_FCFGM_ESEL_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGM_Bits.ESEL */
#define IFX_EDSADC_CH_FCFGM_ESEL_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_FCFGM_Bits.ESEL */
#define IFX_EDSADC_CH_FCFGM_ESEL_OFF (22u)

/** \brief Length for Ifx_EDSADC_CH_FCFGM_Bits.EGT */
#define IFX_EDSADC_CH_FCFGM_EGT_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGM_Bits.EGT */
#define IFX_EDSADC_CH_FCFGM_EGT_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_FCFGM_Bits.EGT */
#define IFX_EDSADC_CH_FCFGM_EGT_OFF (24u)

/** \brief Length for Ifx_EDSADC_CH_FCFGM_Bits.CALIB */
#define IFX_EDSADC_CH_FCFGM_CALIB_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGM_Bits.CALIB */
#define IFX_EDSADC_CH_FCFGM_CALIB_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_FCFGM_Bits.CALIB */
#define IFX_EDSADC_CH_FCFGM_CALIB_OFF (28u)

/** \brief Length for Ifx_EDSADC_CH_FCFGM_Bits.AUTOCAL */
#define IFX_EDSADC_CH_FCFGM_AUTOCAL_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGM_Bits.AUTOCAL */
#define IFX_EDSADC_CH_FCFGM_AUTOCAL_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_FCFGM_Bits.AUTOCAL */
#define IFX_EDSADC_CH_FCFGM_AUTOCAL_OFF (29u)

/** \brief Length for Ifx_EDSADC_CH_FCFGM_Bits.CSRWC */
#define IFX_EDSADC_CH_FCFGM_CSRWC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGM_Bits.CSRWC */
#define IFX_EDSADC_CH_FCFGM_CSRWC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_FCFGM_Bits.CSRWC */
#define IFX_EDSADC_CH_FCFGM_CSRWC_OFF (31u)

/** \brief Length for Ifx_EDSADC_CH_FCFGC_Bits.CFMDF */
#define IFX_EDSADC_CH_FCFGC_CFMDF_LEN (9u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGC_Bits.CFMDF */
#define IFX_EDSADC_CH_FCFGC_CFMDF_MSK (0x1ffu)

/** \brief Offset for Ifx_EDSADC_CH_FCFGC_Bits.CFMDF */
#define IFX_EDSADC_CH_FCFGC_CFMDF_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_FCFGC_Bits.CFMSV */
#define IFX_EDSADC_CH_FCFGC_CFMSV_LEN (9u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGC_Bits.CFMSV */
#define IFX_EDSADC_CH_FCFGC_CFMSV_MSK (0x1ffu)

/** \brief Offset for Ifx_EDSADC_CH_FCFGC_Bits.CFMSV */
#define IFX_EDSADC_CH_FCFGC_CFMSV_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_FCNTC_Bits.CFMDCNT */
#define IFX_EDSADC_CH_FCNTC_CFMDCNT_LEN (9u)

/** \brief Mask for Ifx_EDSADC_CH_FCNTC_Bits.CFMDCNT */
#define IFX_EDSADC_CH_FCNTC_CFMDCNT_MSK (0x1ffu)

/** \brief Offset for Ifx_EDSADC_CH_FCNTC_Bits.CFMDCNT */
#define IFX_EDSADC_CH_FCNTC_CFMDCNT_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_FCNTC_Bits.CAL */
#define IFX_EDSADC_CH_FCNTC_CAL_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_FCNTC_Bits.CAL */
#define IFX_EDSADC_CH_FCNTC_CAL_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_FCNTC_Bits.CAL */
#define IFX_EDSADC_CH_FCNTC_CAL_OFF (30u)

/** \brief Length for Ifx_EDSADC_CH_OVSCFG_Bits.SRFS */
#define IFX_EDSADC_CH_OVSCFG_SRFS_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_OVSCFG_Bits.SRFS */
#define IFX_EDSADC_CH_OVSCFG_SRFS_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_OVSCFG_Bits.SRFS */
#define IFX_EDSADC_CH_OVSCFG_SRFS_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_OVSCFG_Bits.SRFRT */
#define IFX_EDSADC_CH_OVSCFG_SRFRT_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_OVSCFG_Bits.SRFRT */
#define IFX_EDSADC_CH_OVSCFG_SRFRT_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_OVSCFG_Bits.SRFRT */
#define IFX_EDSADC_CH_OVSCFG_SRFRT_OFF (2u)

/** \brief Length for Ifx_EDSADC_CH_OVSCFG_Bits.SDM */
#define IFX_EDSADC_CH_OVSCFG_SDM_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_OVSCFG_Bits.SDM */
#define IFX_EDSADC_CH_OVSCFG_SDM_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_OVSCFG_Bits.SDM */
#define IFX_EDSADC_CH_OVSCFG_SDM_OFF (4u)

